RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_audio.h
/**
  ******************************************************************************
  * @file    bl808_audio.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL808_AUDIO_H__
#define __BL808_AUDIO_H__

#include "audio_reg.h"
#include "bl808_common.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  AUDIO
 *  @{
 */

/** @defgroup  AUDIO_Public_Types
 *  @{
 */

/**
 *  @brief Audio ADC ID
 */
typedef enum {
    AUDIO_ADC_0, /*!< Audio ADC 0 */
    AUDIO_ADC_1, /*!< Audio ADC 1 */
    AUDIO_ADC_2, /*!< Audio ADC 2 */
} Audio_ADC_ID_Type;

/**
 *  @brief Audio DAC ID
 */
typedef enum {
    AUDIO_DAC_0, /*!< Audio DAC 0 */
    AUDIO_DAC_1, /*!< Audio DAC 1 */
} Audio_DAC_ID_Type;

/**
 *  @brief Audio AEC ID
 */
typedef enum {
    AUDIO_AEC_0, /*!< Audio AEC 0 */
    AUDIO_AEC_1, /*!< Audio AEC 1 */
} Audio_AEC_ID_Type;

/**
 *  @brief Audio PDM ID
 */
typedef enum {
    AUDIO_PDM_0, /*!< select PDM Channel 0 */
    AUDIO_PDM_1, /*!< select PDM Channel 1 */
    AUDIO_PDM_2, /*!< select PDM Channel 2 */
} Audio_PDM_ID_Type;

/**
 *  @brief Audio MUTE
 */
typedef enum {
    AUDIO_UNMUTE, /*!< unmute */
    AUDIO_MUTE,   /*!< mute */
} Audio_Mute_Type;

/**
 *  @brief Audio ADC Clock
 */
typedef enum {
    AUDIO_ADC_8_KHZ,  /*!< Audio ADC Clock set as 8KHZ */
    AUDIO_ADC_16_KHZ, /*!< Audio ADC Clock set as 16KHZ */
    AUDIO_ADC_24_KHZ, /*!< Audio ADC Clock set as 24KHZ */
    AUDIO_ADC_32_KHZ, /*!< Audio ADC Clock set as 32KHZ */
    AUDIO_ADC_48_KHZ, /*!< Audio ADC Clock set as 48KHZ */
    AUDIO_ADC_96_KHZ, /*!< Audio ADC Clock set as 96KHZ */
} Audio_ADC_Clock_Type;

/**
 *  @brief Audio DAC Clock
 */
typedef enum {
    AUDIO_DAC_8_KHZ,   /*!< Audio DAC Clock set as 8KHZ */
    AUDIO_DAC_16_KHZ,  /*!< Audio DAC Clock set as 16KHZ */
    AUDIO_DAC_24_KHZ,  /*!< Audio DAC Clock set as 24KHZ */
    AUDIO_DAC_32_KHZ,  /*!< Audio DAC Clock set as 32KHZ */
    AUDIO_DAC_48_KHZ,  /*!< Audio DAC Clock set as 48KHZ */
    AUDIO_DAC_96_KHZ,  /*!< Audio DAC Clock set as 96KHZ */
    AUDIO_DAC_192_KHZ, /*!< Audio DAC Clock set as 192KHZ */
} Audio_DAC_Clock_Type;

/**
 *  @brief Audio ADC Source Interface
 */
typedef enum {
    AUDIO_ADC_ANALOG, /*!< set AUDIO ADC as ANALOG mode connect AMIC */
    AUDIO_ADC_PDM,    /*!< set AUDIO ADC as PDM mode connect to DMIC */
} Audio_ADC_Source_Type;

/**
 *  @brief Audio LSFR Type
 */
typedef enum {
    AUDIO_LFSR32, /*!< Audio LFSR32 */
    AUDIO_LFSR24, /*!< Audio LFSR24 */
    AUDIO_LFSR16, /*!< Audio LFSR16 */
    AUDIO_LFSR12, /*!< Audio LFSR12 */
} Audio_LFSR_Type;

/**
 *  @brief Audio Mixer Mode
 */
typedef enum {
    AUDIO_SECOND_DEBUG_MODE = 0x1, /*!< Audio second mode debug mode */
    AUDIO_SIDETONE_LOOPBACK = 0x2, /*!< Audio sidetone mode mix will mixer dac with adc data */
} Audio_Mixer_Mode;

/**
 *  @brief Audio Mixer Volume Type
 */
typedef enum {
    AUDIO_MIXER_VOLUME_0_DB,  /*!< Audio Mix Volume 0DB */
    AUDIO_MIXER_VOLUME_6_DB,  /*!< Audio Mix Volume 6DB */
    AUDIO_MIXER_VOLUME_12_DB, /*!< Audio Mix Volume 12DB */
    AUDIO_MIXER_VOLUME_18_DB, /*!< Audio Mix Volume 18DB */
    AUDIO_MIXER_VOLUME_36_DB, /*!< Audio Mix Volume 36DB */
    AUDIO_MIXER_VOLUME_54_DB, /*!< Audio Mix Volume 54DB */
    AUDIO_MIXER_VOLUME_72_DB, /*!< Audio Mix Volume 72DB */
    AUDIO_MIXER_VOLUME_MUTE,  /*!< Audio Mix Volume Mute */
} Audio_Mixer_Volume_Type;

/**
 *  @brief Audio Mixer ID
 */
typedef enum {
    AUDIO_MIXER_ID_0, /*!< Audio Mix ID 0 */
    AUDIO_MIXER_ID_1, /*!< Audio Mix ID 1 */
} Audio_Mixer_ID_Type;

/**
 *  @brief Audio dac order
 */
typedef enum {
    AUDIO_DAC_2_ORDER, /*!< Audio ORDER 2 */
    AUDIO_DAC_3_ORDER, /*!< Audio ORDER 3 */
} Audio_DAC_Order_Type;

/**
 *  @brief Audio aec attenuation mode
 */
typedef enum {
    AUDIO_AEC_NO_DROP,    /*!< DROP 0 LSB */
    AUDIO_AEC_DROP_1LSB,  /*!< DROP 1 LSB */
    AUDIO_AEC_DROP_2LSB,  /*!< DROP 2 LSB */
    AUDIO_AEC_DROP_3LSB,  /*!< DROP 3 LSB */
    AUDIO_AEC_DROP_6LSB,  /*!< DROP 6 LSB */
    AUDIO_AEC_DROP_9LSB,  /*!< DROP 9 LSB */
    AUDIO_AEC_DROP_12LSB, /*!< DROP 12 LSB */
} Audio_AEC_Atten_Mode;

/**
 *  @brief Audio PDM Source Select
 */
typedef enum {
    AUDIO_PDM_0_L, /*!< select PDM0 Left  Channel */
    AUDIO_PDM_0_R, /*!< select PDM0 Right Channel */
    AUDIO_PDM_1_L, /*!< select PDM1 Left  Channel */
    AUDIO_PDM_1_R, /*!< select PDM1 Right Channel */
    AUDIO_PDM_2_L, /*!< select PDM2 Left  Channel */
    AUDIO_PDM_2_R, /*!< select PDM2 Right Channel */
} Audio_PDM_Source_Type;

/**
 *  @brief Audio Resolution
 */
typedef enum {
    AUDIO_RES_16_BITS, /*!< select ADC Resolution as 16 bit */
    AUDIO_RES_20_BITS, /*!< select ADC Resolution as 20 bit */
} Audio_Resolution_Type;

/**
 *  @brief Audio Resolution
 */
typedef enum {
    AUDIO_FIFO_AILGN_MSB_AT_BIT31, /*!< Mode 0: Valid data's MSB is at [31] of FIFO register */
    AUDIO_FIFO_AILGN_MSB_AT_BIT23, /*!< Mode 1: Valid data's MSB is at [23] of FIFO register */
    AUDIO_FIFO_AILGN_MSB_AT_BIT19, /*!< Mode 2: Valid data's MSB is at [19] of FIFO register */
    AUDIO_FIFO_AILGN_MSB_AT_BIT15, /*!< Mode 3: Valid data's MSB is at [15] of FIFO register */
} Audio_FIFO_Ailgn_Mode;

/**
 *  @brief Audio Resolution
 */
typedef enum {
    AUDIO_DRQ_EQUEL_TO_IRQ,       /*!< DMA request threhold is equeal to Interrupt threhold */
    AUDIO_DRQ_THR_AS_4_TX_8_RX,   /*!< DMA request threhold is 4 when config TX FIFO DRQ , 8 when config RX FIFO */
    AUDIO_DRQ_THR_AS_8_TX_16_RX,  /*!< DMA request threhold is 8 when config TX FIFO DRQ , 16 when config RX FIFO */
    AUDIO_DRQ_THR_AS_16_TX_32_RX, /*!< DMA request threhold is 16 when config TX FIFO DRQ , 32 when config RX FIFO */
} Audio_FIFO_DQR_Threshold_Mode;

/**
 *  @brief Audio initerrupt type
 */
typedef enum {
    AUDIO_INT_RX_FIFO_THR,          /*!< Audio RX FIFO counter upper than threhold interrupt */
    AUDIO_INT_RX_FIFO_OVERRUN,      /*!< Audio RX FIFO overrun */
    AUDIO_INT_RX_FIFO_UNDERRUN,     /*!< Audio RX FIFO underrun */
    AUDIO_INT_TX_FIFO_THR,          /*!< Audio TX FIFO THL */
    AUDIO_INT_TX_FIFO_OVERRUN,      /*!< Audio TX FIFO overrun */
    AUDIO_INT_TX_FIFO_UNDERRUN,     /*!< Audio TX FIFO underrun */
    AUDIO_INT_ADC0_SET_VOLUME_DONE, /*!< Audio set ADC0 volume done */
    AUDIO_INT_ADC1_SET_VOLUME_DONE, /*!< Audio set ADC1 volume done */
    AUDIO_INT_ADC2_SET_VOLUME_DONE, /*!< Audio set ADC2 volume done */
    AUDIO_INT_DAC0_SET_VOLUME_DONE, /*!< Audio set DAC0 volume done */
    AUDIO_INT_DAC1_SET_VOLUME_DONE, /*!< Audio set DAC1 volume done */
    AUDIO_INT_VAD,                  /*!< Audio VAD */
    AUDIO_INT_NUM_ALL,              /*!< Audio int all */
} Audio_INT_Type;

/**
 *  @brief Audio peq qtfm
 */
typedef enum {
    AUDIO_PEQ_QFMT_20_17, /*!< Audio QFMT 20.17 */
    AUDIO_PEQ_QFMT_20_16, /*!< Audio QFMT 20.16 */
} Audio_PEQ_QTFM_Type;

/**
 *  @brief Audio mute mode
 */
typedef enum {
    AUIDO_MUTE_DIRECTLY,       /*!< mute directly */
    AUDIO_MUTE_WITH_RAMP_DOWN, /*!< mute with rampdown */
} Audio_Mute_Mode;

/**
 *  @brief Audio ramp rate
 */
typedef enum {
    AUIDO_RAMP_RATE_2_FS,    /*!< ramp rate 2 fs */
    AUIDO_RAMP_RATE_4_FS,    /*!< ramp rate 4 fs */
    AUIDO_RAMP_RATE_8_FS,    /*!< ramp rate 8 fs */
    AUIDO_RAMP_RATE_16_FS,   /*!< ramp rate 16 fs */
    AUIDO_RAMP_RATE_32_FS,   /*!< ramp rate 32 fs */
    AUIDO_RAMP_RATE_64_FS,   /*!< ramp rate 64 fs */
    AUIDO_RAMP_RATE_128_FS,  /*!< ramp rate 128 fs */
    AUIDO_RAMP_RATE_256_FS,  /*!< ramp rate 256 fs */
    AUIDO_RAMP_RATE_512_FS,  /*!< ramp rate 512 fs */
    AUIDO_RAMP_RATE_1024_FS, /*!< ramp rate 1024 fs */
    AUIDO_RAMP_RATE_2048_FS, /*!< ramp rate 2048 fs */
} Audio_Ramp_Rate_Type;

/**
 *  @brief Audio zero cross rate
 */
typedef enum {
    AUIDO_ZERO_CROSS_RATE_2_FS,    /*!< ramp rate 2 fs */
    AUIDO_ZERO_CROSS_RATE_4_FS,    /*!< ramp rate 4 fs */
    AUIDO_ZERO_CROSS_RATE_8_FS,    /*!< ramp rate 8 fs */
    AUIDO_ZERO_CROSS_RATE_16_FS,   /*!< ramp rate 16 fs */
    AUIDO_ZERO_CROSS_RATE_32_FS,   /*!< ramp rate 32 fs */
    AUIDO_ZERO_CROSS_RATE_64_FS,   /*!< ramp rate 64 fs */
    AUIDO_ZERO_CROSS_RATE_128_FS,  /*!< ramp rate 128 fs */
    AUIDO_ZERO_CROSS_RATE_256_FS,  /*!< ramp rate 256 fs */
    AUIDO_ZERO_CROSS_RATE_512_FS,  /*!< ramp rate 512 fs */
    AUIDO_ZERO_CROSS_RATE_1024_FS, /*!< ramp rate 1024 fs */
    AUIDO_ZERO_CROSS_RATE_2048_FS, /*!< ramp rate 2048 fs */
} Audio_Zero_Cross_Rate_Type;

/**
 *  @brief Audio volume ctr mode
 */
typedef enum {
    AUIDO_VOLUME_UPDATE_FORCE,            /*!< volume update force */
    AUIDO_VOLUME_UPDATE_AT_ZERO_CROSSING, /*!< volume update at zero crossing */
    AUIDO_VOLUME_UPDATE_AT_RAMP,          /*!< volume update at zero crossing */
} Audio_Volume_Ctr_Mode;

/**
 *  @brief Audio_AGC_Detect_Mode
 */
typedef enum {
    AUIDO_AGC_DETECT_BY_PEAK,    /*!< detect by peak */
    AUIDO_AGC_DETECT_BY_AVERAGE, /*!< detect by average */
} Audio_AGC_Detect_Mode;

/**
 *  @brief Audio_AGC_Src_Type
 */
typedef enum {
    AUIDO_AGC_CH0_ABSOLUTE_VALUE,     /*!< Audio AGC CH0 */
    AUIDO_AGC_CH1_ABSOLUTE_VALUE,     /*!< Audio AGC CH1 */
    AUIDO_AGC_CH2_ABSOLUTE_VALUE,     /*!< Audio AGC CH2 */
    AUIDO_AGC_MAXIMUM_VALUE_OF_CH012, /*!< Audio AGC Max value of ch012 */
} Audio_AGC_Src_Type;

/**
 *  @brief Auido_DRC_Data_Type
 */
typedef enum {
    AUIDO_DRC_DATA_SOURCE_CH0,                /*!< Audio DRC SOURCE CH0 */
    AUIDO_DRC_DATA_SOURCE_CH1,                /*!< Audio DRC SOURCE CH1 */
    AUIDO_DRC_DATA_SOURCE_AVERAGE_OF_CH0_CH1, /*!< Audio DRC SOURCE (CH0+CH1)/2 */
    AUIDO_DRC_DATA_SOURCE_MAX_OF_CH0_CH1,     /*!< Audio DRC MAX(CH0,CH1) */
} Auido_DRC_Data_Type;

/**
 *  @brief Auido_VAD_Source_Type
 */
typedef enum {
    AUIDO_VAD_DATA_SOURCE_ADC_CH0,                 /*!< Audio ADC CH0 */
    AUIDO_VAD_DATA_SOURCE_ADC_CH1,                 /*!< Audio ADC CH1 */
    AUIDO_VAD_DATA_SOURCE_ADC_CH2,                 /*!< Audio ADC CH2 */
    AUIDO_VAD_DATA_SOURCE_AEC_CH0,                 /*!< Audio AEC CH0 */
    AUIDO_VAD_DATA_SOURCE_AEC_CH1,                 /*!< Audio AEC CH1 */
    AUDIO_VAD_DATA_SOURCE_AVERAGE_ADC_CH0_ADD_CH1, /*!< Audio (ADC0+ADC1)/2 */
    AUDIO_VAD_DATA_SOURCE_AVERAGE_ADC_CH1_ADD_CH2, /*!< Audio (ADC1+ADC2)/2 */
    AUDIO_VAD_DATA_SOURCE_AVERAGE_ADC_CH2_ADD_CH0, /*!< Audio (ADC2+ADC0)/2 */
} Auido_VAD_Source_Type;

/**
 *  @brief Auido_VAD_FramingShift_Type
 */
typedef enum {
    AUIDO_VAD_FRAMING_SHIFT_2P5_MS,  /*!< Audio VAD FramingShift = 2.5 */
    AUIDO_VAD_FRAMING_SHIFT_5_MS,    /*!< Audio VAD FramingShift = 5 */
    AUIDO_VAD_FRAMING_SHIFT_7P5_MS,  /*!< Audio VAD FramingShift = 7.5 */
    AUIDO_VAD_FRAMING_SHIFT_10_MS,   /*!< Audio VAD FramingShift = 10 */
    AUIDO_VAD_FRAMING_SHIFT_12P5_MS, /*!< Audio VAD FramingShift = 12.5 */
    AUIDO_VAD_FRAMING_SHIFT_15_MS,   /*!< Audio VAD FramingShift = 15 */
    AUIDO_VAD_FRAMING_SHIFT_17P5_MS, /*!< Audio VAD FramingShift = 17.5 */
    AUIDO_VAD_FRAMING_SHIFT_20_MS,   /*!< Audio VAD FramingShift = 20 */
} Auido_VAD_FramingShift_Type;

/**
 *  @brief Auido_VAD_FramingTime_Type
 */
typedef enum {
    AUIDO_VAD_FRAMING_TIME_2, /*!< Audio VAD FramingTime  K= 2 */
    AUIDO_VAD_FRAMING_TIME_3, /*!< Audio VAD FramingTime  K= 3 */
    AUIDO_VAD_FRAMING_TIME_4, /*!< Audio VAD FramingTime  K= 4 */
    AUIDO_VAD_FRAMING_TIME_5, /*!< Audio VAD FramingTime  K= 5 */
} Auido_VAD_FramingTime_Type;

/**
 *  @brief Auido_VAD_FramingTime_Type
 */
typedef enum {
    AUIDO_VAD_ORIGINAL_OUTPUT, /*!< Original VAD output(VAD00) */
    AUIDO_VAD_OUT0,            /*!< Debounced VAD output(VADout0), with small NDV but large DL */
    AUIDO_VAD_OUT1,            /*!< Debounced VAD output(VADout1) */
    AUIDO_VAD_OUT2,            /*!< Debounced VAD output(VADout2), with small DL but large NDV */
} Auido_VAD_IRQ_Source_Type;

/**
 *  @brief Auido_VAD_NoisyBufferLen_Type
 */
typedef enum {
    AUIDO_VAD_NOISY_BUF_LEN_4,  /*!< noise buffer length control 4 */
    AUIDO_VAD_NOISY_BUF_LEN_8,  /*!< noise buffer length control 8 */
    AUIDO_VAD_NOISY_BUF_LEN_12, /*!< noise buffer length control 12 */
    AUIDO_VAD_NOISY_BUF_LEN_16, /*!< noise buffer length control 16 */
    AUIDO_VAD_NOISY_BUF_LEN_20, /*!< noise buffer length control 20 */
    AUIDO_VAD_NOISY_BUF_LEN_24, /*!< noise buffer length control 24 */
    AUIDO_VAD_NOISY_BUF_LEN_28, /*!< noise buffer length control 28 */
    AUIDO_VAD_NOISY_BUF_LEN_32, /*!< noise buffer length control 32 */
} Auido_VAD_NoisyBufferLen_Type;

/**
 *  @brief noise buffer monitor control, forcing noise buffer to refresh when both:VAD goes into high and VAD high last for2'h0: 1s2'h1: 2s2'h2: 4s 2'h3: 8s this monit function is designed in case that VAD is locked into active state and noise buffer no longer refreshes itself. this will happen when audio-background-noise suddenly changes from a relative low level to a much higher one
 */
typedef enum {
    AUIDO_VAD_NOISY_MONITOR_1_S, /*!< noise monitor 1 s */
    AUIDO_VAD_NOISY_MONITOR_2_S, /*!< noise monitor 2 s */
    AUIDO_VAD_NOISY_MONITOR_4_S, /*!< noise monitor 4 s */
    AUIDO_VAD_NOISY_MONITOR_8_S, /*!< noise monitor 8 s */
} Auido_VAD_NoisyBufferMonitor_Type;

/**
 *  @brief Audio Clock Configuration
 */
typedef struct {
    Audio_ADC_Clock_Type adc_clock; /*!< ADC Rate Configuration */
    Audio_DAC_Clock_Type dac_clock; /*!< DAC Rate Configuration */
    BL_Fun_Type pdm_clk_inv;        /*!< enable or not pdm clock inv */
    BL_Fun_Type adc_clk_inv;        /*!< enable or not adc clock inv */
    BL_Fun_Type dac_clk_inv;        /*!< enable or not dac clock inv */
} Audio_Clock_CFG_Type;

/**
 *  @brief Audio FIFO Configuration
 */
typedef struct {
    Audio_Resolution_Type resolution;               /*!< Receiving Audio Sample Resolution */
    Audio_FIFO_Ailgn_Mode ailgnMode;                /*!< FIFO alignMode */
    uint8_t FifoIntThreshold;                       /*!< FIFO IRQ Threshold */
    Audio_FIFO_DQR_Threshold_Mode dmaThresholdMode; /*!< FIFO DRQ Threshold mode */
    BL_Fun_Type dmaEn;                              /*!< enable DMA FIFO interface */
} Audio_FifoCfg_Type;

/**
 *  @brief Audio Volume Configuration
 */
typedef struct {
    Audio_Mute_Mode muteMode;                          /*!< Audio mute mode   directly mute or use ramp down */
    Audio_Ramp_Rate_Type muteRmpdnRate;                /*!< mute ramp down rate when voice is in up process this parameter define slope */
    Audio_Ramp_Rate_Type muteRmpupRate;                /*!< mute ramp up rate when voice is in down process this parameter define slop */
    Audio_Volume_Ctr_Mode volumeCtrMode;               /*!< volume will update at direct or zero crossing or ramp */
    Audio_Zero_Cross_Rate_Type volumeZeroCrossRate;    /*!< when volume ctrl is zero crossing , select crossing rate */
    Audio_Ramp_Rate_Type volumeRmpRate;                /*!< when volume ctrl is ramp ,select ramp rate */
    Audio_Zero_Cross_Rate_Type volumeZeroCrossTimeout; /*!< if select zero cross mode ,  set volume directly when time out */
} Audio_Volume_Cfg_Type;

/**
 *  @brief Audio VAD Configuration
 */
typedef struct {
    Auido_VAD_Source_Type vadSource;                         /*!< VAD source select */
    Auido_VAD_FramingShift_Type vadFramingShift;             /*!< framing-shift control */
    Auido_VAD_FramingTime_Type vadFramingTime;               /*!< framing-time control, K times of framing-shift */
    Auido_VAD_IRQ_Source_Type vadIRQSource;                  /*!< select witch VAD output as final IRQ */
    BL_Fun_Type vadNoisyBufferMonitorEnable;                 /*!< enable or not noisy buffer monitor */
    Auido_VAD_NoisyBufferLen_Type vadNoisyBufferLen;         /*!< noise buffer length control */
    Auido_VAD_NoisyBufferMonitor_Type vadNoisyBufferMonitor; /*!< this monit function is designed in case that VAD is locked into active state and noise buffer
                                                 no longer refreshes itself. this will happen when audio-background-noise suddenly changes from a
                                                 relative low level to a much higher one */
    uint32_t noisyBufferThr;                                 /*!< vad_noise_th */
    uint8_t noisyBufferDiscardNumber;                        /*!< noise buffer discard number: */
    uint16_t noisyBufferThrBais;                             /*!< bias for noise threshold(s8.8, 2's) */
    uint8_t noisyBufferThrScale;                             /*!< noise threshold scale factor, real scale factor in circuit=dec(nth_scale)/256 */
    uint16_t vadNoisyMaxLimit;                               /*!< noise threshold max limitation */
    BL_Fun_Type vadNoisyMaxLimitEnable;                      /*!< noise threshold max limitation enable signal */
    uint16_t vadNoisyMinLimit;                               /*!< noise threshold min limitation */
    BL_Fun_Type vadNoisyMinLimitEnable;                      /*!< noise threshold min limitation enable signal */
    uint16_t vadSmoothRise;                                  /*!< VAD output debouce, remove the positive pulse whose width is smaller than Register Value, the
                                                 real debouce time = Resister Vale * framing-shift */
    uint16_t vadSmoothFall;                                  /*!< VAD output debouce, remove the negative pulse whose width is smaller than Register Value, the
                                                 real debouce time = Resister Vale * framing-shift */
} Audio_VAD_Cfg_Type;

/**
 *  @brief Audio agc Config
 */
typedef struct {
    BL_Fun_Type agc_force_gain_en;         /*!< 1 force agc gain */
    uint16_t agc_force_gain_ind;           /*!< force agc gain index //default 0 -6-24 */
    uint16_t agc_max_gain_qdb;             /*!< agc maximun gain //default 24 -6-24 */
    uint16_t agc_min_gain_qdb;             /*!< agc minimum gain */
    uint8_t agc_level_target;              /*!< agc level target //default-12 -6--20 */
    uint8_t agc_level_hyst_attack;         /*!< agc level hysteresis attack */
    uint8_t agc_level_hyst_decay;          /*!< agc level hysteresis decay */
    uint8_t agc_hold_time_ms;              /*!< agc hold time(ms)//0-32,1-64,2-96,3-128,4-256,5-512 default 96 */
    uint8_t agc_decay_time_ms;             /*!< agc decay time(ms) //0-32,1-64,2-96,3-128,4-256,5-512 default 64 */
    uint8_t agc_attack_time_ms;            /*!< agc attack time(ms) //0-8,1-16,2-24,3-32,4-64,5-128 default 16 */
    BL_Fun_Type adc3_pga_hw_ctrl;          /*!< 1 enable hw control */
    BL_Fun_Type adc2_pga_hw_ctrl;          /*!< 1 enable hw control */
    BL_Fun_Type adc1_pga_hw_ctrl;          /*!< 1 enable hw control */
    uint8_t agc_noise_gate_th;             /*!< agc noise gate threshold //default -48 -32--72 */
    uint8_t agc_noise_gate_hyst;           /*!< agc noise gate hysteresis //default 2 0/1/2/4 */
    uint8_t agc_silence_gain_qdb;          /*!< agc silence gain qdb //s9.2, default 0 */
    uint8_t agc_silence_gain_wait_ms;      /*!< agc silence gain wait time(ms) */
    uint8_t agc_noise_enter_time_ms;       /*!< agc noise enter time //default 0 NORMAL_SILENCE_DEBOUNCE_TIME_MS 0/1/2/4/8/16/32/64/96/128 */
    uint8_t agc_noise_exit_time_ms;        /*!< agc noise exit time(ms) //default 0 SILENCE_NORMAL_DEBOUNCE_TIME_MS 0/1/2/4/8/16/32/64/96/128 */
    uint8_t agc_dbv_settle_time;           /*!< agc dbv settle time */
    Audio_AGC_Src_Type agc_src_select;     /*!< agc source select  0 ch0 absolute value, 1 ch1 absolute value, 2 ch2 absolute value, 3 maximum
                                                 value of ch0/1/2 */
    Audio_AGC_Detect_Mode agc_detect_mode; /*!< 0 detect by peak, 1 detect by average */
    uint8_t agc_attack_time;               /*!< agc peak filter attack time */
    uint8_t agc_release_time;              /*!< agc peak filter release time */
    uint8_t agc_average_time;              /*!< agc rms filter average time */
    BL_Fun_Type agc_pga_ctrl_en;           /*!< 1 enable pga controlled by hw agc */
} Audio_AGC_Config_Type;

